Documents/ИнвентаризацияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИнвентаризацияЗапасов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Номенклатура</Name><Comment/><ExtendedConfigurationObject>2106931b-7b32-4046-b9bd-d4e5af1d406b</ExtendedConfigurationObject><Type><v8:Type>cfg:CatalogRef.Номенклатура</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Характеристика</Name><Comment/><ExtendedConfigurationObject>8aec899d-dcc8-4810-b190-149dd1993720</ExtendedConfigurationObject><Type><v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Партия</Name><Comment/><ExtendedConfigurationObject>4eee77c8-c9ef-451d-becc-c71173a88175</ExtendedConfigurationObject><Type><v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>СерииНоменклатуры</Name><Comment/><ExtendedConfigurationObject>c6843896-8b61-42d4-8133-f67a8fe9de3c</ExtendedConfigurationObject><Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>150</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Отклонение</Name><Comment/><ExtendedConfigurationObject>0e07d532-06bc-4ae2-8003-deb6823a7a89</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Количество</Name><Comment/><ExtendedConfigurationObject>ed03fb93-6f2e-42fb-9587-4b7e4bd4654b</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>КоличествоУчет</Name><Comment/><ExtendedConfigurationObject>df7d1a0b-c2f9-464e-83a0-8f0872965fcf</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>ЕдиницаИзмерения</Name><Comment/><ExtendedConfigurationObject>d56c98fd-b1e1-4998-bc41-55fd47c8e38e</ExtendedConfigurationObject><Type><v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type><v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Цена</Name><Comment/><ExtendedConfigurationObject>d43a90cc-b538-4ec8-acf6-212c55c79725</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>2</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Сумма</Name><Comment/><ExtendedConfigurationObject>deb09300-3da1-4b6d-ac8f-2fc135481a80</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>2</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>СуммаУчет</Name><Comment/><ExtendedConfigurationObject>6f8a8ae0-e84c-428b-9b5e-e9e52f19b700</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>15</v8:Digits><v8:FractionDigits>2</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>КлючСвязи</Name><Comment/><ExtendedConfigurationObject>06b0094c-1a30-4af8-862f-8de6d3327006</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>5</v8:Digits><v8:FractionDigits>0</v8:FractionDigits><v8:AllowedSign>Nonnegative</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Излишки</Name><Comment/><ExtendedConfigurationObject>88200c46-96ad-4c56-81ae-5d8912146d21</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Недостача</Name><Comment/><ExtendedConfigurationObject>a2b9879f-ea8e-44bb-9308-0f1dd2075409</ExtendedConfigurationObject><Type><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Digits>10</v8:Digits><v8:FractionDigits>3</v8:FractionDigits><v8:AllowedSign>Any</v8:AllowedSign></v8:NumberQualifiers></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>ИзлишкиСоответствуетОтбору</Name><Comment/><ExtendedConfigurationObject>798fd4c2-2bd3-4835-8b70-188524624e8f</ExtendedConfigurationObject><Type><v8:Type>xs:boolean</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>НедостачаСоответствуетОтбору</Name><Comment/><ExtendedConfigurationObject>43e55d98-383b-4ad0-bdf2-9e792100be70</ExtendedConfigurationObject><Type><v8:Type>xs:boolean</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>ОтклонениеСоответствуетОтбору</Name><Comment/><ExtendedConfigurationObject>cdd4a48f-3cf8-4be3-9dfe-0360c6e3afbc</ExtendedConfigurationObject><Type><v8:Type>xs:boolean</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Пометка</Name><Comment/><ExtendedConfigurationObject>67bfb987-366f-49ee-9803-7216b7670cef</ExtendedConfigurationObject><Type><v8:Type>xs:boolean</v8:Type></Type></Properties></Attribute>
					<Attribute><InternalInfo/><Properties><ObjectBelonging>Adopted</ObjectBelonging><Name>Ячейка</Name><Comment/><ExtendedConfigurationObject>070574b6-a75d-4681-bb38-5359de312dd7</ExtendedConfigurationObject><Type><v8:Type>cfg:CatalogRef.Ячейки</v8:Type></Type></Properties></Attribute>
					<Attribute>
						<Properties>
							<Name>АС_Согласованность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_Несогласован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнвентаризацияЗапасов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем АС_СтрокаКоличествоИсходная;

&НаКлиенте
Перем АС_СтрокаКоличествоСледующая;

&НаСервере
&После("ОбработатьОтклонения")
Процедура АС_ОбработатьОтклоненияПосле()

	Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
		Если СтрокаЗапасов.Количество = 0 Тогда
			СтрокаЗапасов.НедостачаСоответствуетОтбору = Ложь;
		КонецЕсли;
		СтрокаЗапасов.АС_Несогласован = Не СтрокаЗапасов.АС_Согласованность
			И СтрокаЗапасов.Количество <> 0;
	КонецЦикла;

КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура АС_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаЗапасов Из ТекущийОбъект.Запасы Цикл
		Если СтрокаЗапасов.Количество = 0 Тогда
			СтрокаЗапасов.НедостачаСоответствуетОтбору = Ложь;
		КонецЕсли;
		СтрокаЗапасов.АС_Несогласован = Не СтрокаЗапасов.АС_Согласованность
			И СтрокаЗапасов.Количество <> 0;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
&Перед("ЗапасыКоличествоПриИзменении")
Процедура АС_ЗапасыКоличествоПриИзмененииПеред(Элемент)

	АС_СтрокаКоличествоИсходная = Неопределено;
	АС_СтрокаКоличествоСледующая = Неопределено;

	ОтборСтрок = Элементы.Запасы.ОтборСтрок;
	Если ОтборСтрок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	АС_СтрокаКоличествоИсходная = ТекущаяСтрока.ПолучитьИдентификатор();
	ИндексТекущейСтроки = Объект.Запасы.Индекс(ТекущаяСтрока);

	Для ИндексСтроки = ИндексТекущейСтроки + 1 По Объект.Запасы.Количество() - 1 Цикл
		Кандидат = Объект.Запасы[ИндексСтроки];
		Если АС_СтрокаСоответствуетОтбору(Кандидат, ОтборСтрок) Тогда
			АС_СтрокаКоличествоСледующая = Кандидат.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если АС_СтрокаКоличествоСледующая = Неопределено Тогда
		ИндексСтроки = ИндексТекущейСтроки - 1;
		Пока ИндексСтроки >= 0 Цикл
			Кандидат = Объект.Запасы[ИндексСтроки];
			Если АС_СтрокаСоответствуетОтбору(Кандидат, ОтборСтрок) Тогда
				АС_СтрокаКоличествоСледующая = Кандидат.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;
			ИндексСтроки = ИндексСтроки - 1;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция АС_СтрокаСоответствуетОтбору(СтрокаТабличнойЧасти, ОтборСтрок)

	Для Каждого ИмяОтбора Из ОтборСтрок Цикл
		Если СтрокаТабличнойЧасти[ИмяОтбора.Ключ] <> ИмяОтбора.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаКлиенте
&После("ЗапасыКоличествоПриИзменении")
Процедура АС_ЗапасыКоличествоПриИзмененииПосле(Элемент)

	ИсходнаяСтрока = Неопределено;
	Если АС_СтрокаКоличествоИсходная <> Неопределено Тогда
		ИсходнаяСтрока = Объект.Запасы.НайтиПоИдентификатору(АС_СтрокаКоличествоИсходная);
	КонецЕсли;

	Если ИсходнаяСтрока = Неопределено Тогда
		АС_ОбновитьНесогласованностьТекущейСтроки();
	Иначе
		ИсходнаяСтрока.АС_Несогласован = Не ИсходнаяСтрока.АС_Согласованность
			И ИсходнаяСтрока.Количество <> 0;
	КонецЕсли;

	Если АС_СтрокаКоличествоИсходная = Неопределено
		ИЛИ АС_СтрокаКоличествоСледующая = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОтборСтрок = Элементы.Запасы.ОтборСтрок;
	Если ИсходнаяСтрока <> Неопределено
		И (ОтборСтрок = Неопределено
		ИЛИ АС_СтрокаСоответствуетОтбору(ИсходнаяСтрока, ОтборСтрок)) Тогда
		Возврат;
	КонецЕсли;

	ПодключитьОбработчикОжидания("АС_ВосстановитьТекущуюСтрокуПослеКоличество", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура АС_ВосстановитьТекущуюСтрокуПослеКоличество()

	Попытка
		ОтборСтрок = Элементы.Запасы.ОтборСтрок;
		СтрокаДляВыделения = Объект.Запасы.НайтиПоИдентификатору(АС_СтрокаКоличествоСледующая);
		Если СтрокаДляВыделения <> Неопределено
			И ОтборСтрок <> Неопределено
			И АС_СтрокаСоответствуетОтбору(СтрокаДляВыделения, ОтборСтрок) Тогда
			Элементы.Запасы.ТекущаяСтрока = АС_СтрокаКоличествоСледующая;
		КонецЕсли;
	Исключение
		// Таблица могла быть закрыта или перестроена до отложенного вызова.
	КонецПопытки;

	АС_СтрокаКоличествоИсходная = Неопределено;
	АС_СтрокаКоличествоСледующая = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура АС_СогласованностьПриИзменении(Элемент)

	АС_ОбновитьНесогласованностьТекущейСтроки();

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьНесогласованностьТекущейСтроки()

	СтрокаЗапасов = Элементы.Запасы.ТекущиеДанные;
	Если СтрокаЗапасов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаЗапасов.НедостачаСоответствуетОтбору = СтрокаЗапасов.Количество <> 0
		И СтрокаЗапасов.Количество < СтрокаЗапасов.КоличествоУчет;
	СтрокаЗапасов.АС_Несогласован = Не СтрокаЗапасов.АС_Согласованность
		И СтрокаЗапасов.Количество <> 0;

КонецПроцедуры

&НаКлиенте
Процедура АС_ОбновитьНесогласованныеСтроки()

	Для Каждого СтрокаЗапасов Из Объект.Запасы Цикл
		Если СтрокаЗапасов.Количество = 0 Тогда
			СтрокаЗапасов.НедостачаСоответствуетОтбору = Ложь;
		КонецЕсли;
		СтрокаЗапасов.АС_Несогласован = Не СтрокаЗапасов.АС_Согласованность
			И СтрокаЗапасов.Количество <> 0;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АС_СброситьОтборыОтклонений()

	ИзлишкиОтбор = Ложь;
	НедостачаОтбор = Ложь;
	ОтклонениеОтбор = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьОтборПоСогласованным(Команда)

	АС_СброситьОтборыОтклонений();
	ПараметрыОтбора = Новый Структура("АС_Согласованность", Истина);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);

	Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура("АС_Согласованность", Истина);
	Элементы.ДекорацияОтбор.Заголовок = ИнформацияОбОтборе(
		СтрШаблон(НСтр("ru = 'Согласованные (%1)'"), НайденныеСтроки.Количество()));
	Элементы.ДекорацияОтбор.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьОтборПоНесогласованным(Команда)

	АС_СброситьОтборыОтклонений();
	АС_ОбновитьНесогласованныеСтроки();
	ПараметрыОтбора = Новый Структура("АС_Несогласован", Истина);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);

	Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура("АС_Несогласован", Истина);
	Элементы.ДекорацияОтбор.Заголовок = ИнформацияОбОтборе(
		СтрШаблон(НСтр("ru = 'Несогласованные (%1)'"), НайденныеСтроки.Количество()));
	Элементы.ДекорацияОтбор.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьОтборПоОтсутствующим(Команда)

	ИзлишкиОтбор = Ложь;
	НедостачаОтбор = Ложь;
	ОтклонениеОтбор = Ложь;

	ПараметрыОтбора = Новый Структура("Количество", 0);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);

	Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура("Количество", 0);
	Элементы.ДекорацияОтбор.Заголовок = ИнформацияОбОтборе(
		СтрШаблон(НСтр("ru = 'Отсутствующие (%1)'"), НайденныеСтроки.Количество()));
	Элементы.ДекорацияОтбор.Видимость = Истина;

КонецПроцедуры
